Pandas

In [115]:
import pandas as pd

In [116]:
#series
val = pd.Series([12,13,16,4,7,8,25])
print(val)

print(val.loc[4])
val.iloc[6]

0    12
1    13
2    16
3     4
4     7
5     8
6    25
dtype: int64
7

np.int64(25)

In [117]:
#dataframe
df = pd.DataFrame(({
    "name" : ['vishnu','sai','mukesh'],
    "age" : [21,23,24],
    "occupation" : ['ai engineer',"data code entry","web development"]
}))
print(type(df))


df

<class 'pandas.core.frame.DataFrame'>

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development

In [118]:
print(df.head())  # First 5 rows
print(df.tail())      # Last 5 rows
print(df.info())      # Info about columns & datatypes
print(df.describe())  # Summary statistics for numerical columns
print(df.shape)       # (rows, columns)
print(df.columns)     # Column names

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development
     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        3 non-null      object
 1   age         3 non-null      int64
 2   occupation  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
None
             age
count   3.000000
mean   22.666667
std     1.527525
min    21.000000
25%    22.000000
50%    23.000000
75%    23.500000
max    24.000000
(3, 3)
Index(['name', 'age', 'occupation'], dtype='object')

In [119]:
df =df.set_index("name")
print(df)
print(df.columns)

        age       occupation
name
vishnu   21      ai engineer
sai      23  data code entry
mukesh   24  web development
Index(['age', 'occupation'], dtype='object')

In [120]:
df = df.reset_index()
print(df)
df = df.reset_index(drop = True)
df

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development

In [121]:
df.to_csv("sample1.csv",index=False)

In [122]:
pd.read_csv("sample1.csv")

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development

slicing and indexing

In [123]:
df

     name  age       occupation
0  vishnu   21      ai engineer
1     sai   23  data code entry
2  mukesh   24  web development

In [124]:
df.at[1,"age"] = 27
df.iat[0,2] = "Gen AI"
print(df.iloc[2])
print(df.loc[0])
df.loc[3] = ["nithin",32,"jr developer"]

name                   mukesh
age                        24
occupation    web development
Name: 2, dtype: object
name          vishnu
age               21
occupation    Gen AI
Name: 0, dtype: object

In [125]:
df = df.reset_index(drop=True)
df

     name  age       occupation
0  vishnu   21           Gen AI
1     sai   27  data code entry
2  mukesh   24  web development
3  nithin   32     jr developer

In [126]:
print(df.iloc[0:2,:])
print(df.iloc[:,0:3])
print(df.iloc[1:3,1:2])

     name  age       occupation
0  vishnu   21           Gen AI
1     sai   27  data code entry
     name  age       occupation
0  vishnu   21           Gen AI
1     sai   27  data code entry
2  mukesh   24  web development
3  nithin   32     jr developer
   age
1   27
2   24

In [127]:
df.iloc[0:3:2,0:3:2]

     name       occupation
0  vishnu           Gen AI
2  mukesh  web development

****Data Manuplating****

In [128]:
df

     name  age       occupation
0  vishnu   21           Gen AI
1     sai   27  data code entry
2  mukesh   24  web development
3  nithin   32     jr developer

In [129]:
df.age = df.age * 2
df.age = df.age / 2
df

     name   age       occupation
0  vishnu  21.0           Gen AI
1     sai  27.0  data code entry
2  mukesh  24.0  web development
3  nithin  32.0     jr developer

imported csv file

In [130]:
from  sklearn.datasets import fetch_california_housing

In [131]:
ch = fetch_california_housing(as_frame=True).frame
print(ch)

       MedInc  HouseAge  AveRooms  AveBedrms  Population  AveOccup  Latitude  \
0      8.3252      41.0  6.984127   1.023810       322.0  2.555556     37.88
1      8.3014      21.0  6.238137   0.971880      2401.0  2.109842     37.86
2      7.2574      52.0  8.288136   1.073446       496.0  2.802260     37.85
3      5.6431      52.0  5.817352   1.073059       558.0  2.547945     37.85
4      3.8462      52.0  6.281853   1.081081       565.0  2.181467     37.85
...       ...       ...       ...        ...         ...       ...       ...
20635  1.5603      25.0  5.045455   1.133333       845.0  2.560606     39.48
20636  2.5568      18.0  6.114035   1.315789       356.0  3.122807     39.49
20637  1.7000      17.0  5.205543   1.120092      1007.0  2.325635     39.43
20638  1.8672      18.0  5.329513   1.171920       741.0  2.123209     39.43
20639  2.3886      16.0  5.254717   1.162264      1387.0  2.616981     39.37

       Longitude  MedHouseVal
0        -122.23        4.526
1        -122.22        3.585
2        -122.24        3.521
3        -122.25        3.413
4        -122.25        3.422
...          ...          ...
20635    -121.09        0.781
20636    -121.21        0.771
20637    -121.22        0.923
20638    -121.32        0.847
20639    -121.24        0.894

[20640 rows x 9 columns]

In [132]:
print(ch.columns)
ch.info()

Index(['MedInc', 'HouseAge', 'AveRooms', 'AveBedrms', 'Population', 'AveOccup',
       'Latitude', 'Longitude', 'MedHouseVal'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MedInc       20640 non-null  float64
 1   HouseAge     20640 non-null  float64
 2   AveRooms     20640 non-null  float64
 3   AveBedrms    20640 non-null  float64
 4   Population   20640 non-null  float64
 5   AveOccup     20640 non-null  float64
 6   Latitude     20640 non-null  float64
 7   Longitude    20640 non-null  float64
 8   MedHouseVal  20640 non-null  float64
dtypes: float64(9)
memory usage: 1.4 MB

In [133]:
print(ch.head())
print(ch.sample(10))
ch.tail()

   MedInc  HouseAge  AveRooms  AveBedrms  Population  AveOccup  Latitude  \
0  8.3252      41.0  6.984127   1.023810       322.0  2.555556     37.88
1  8.3014      21.0  6.238137   0.971880      2401.0  2.109842     37.86
2  7.2574      52.0  8.288136   1.073446       496.0  2.802260     37.85
3  5.6431      52.0  5.817352   1.073059       558.0  2.547945     37.85
4  3.8462      52.0  6.281853   1.081081       565.0  2.181467     37.85

   Longitude  MedHouseVal
0    -122.23        4.526
1    -122.22        3.585
2    -122.24        3.521
3    -122.25        3.413
4    -122.25        3.422
       MedInc  HouseAge  AveRooms  AveBedrms  Population  AveOccup  Latitude  \
1402   5.0672      24.0  5.919776   1.022388      1351.0  2.520522     37.95
18871  3.8667      37.0  5.894737   1.051282      2083.0  2.811066     38.09
3139   3.0184       9.0  5.420863   1.053957       761.0  2.737410     34.87
4041   7.1390      34.0  7.094000   1.046000      1187.0  2.374000     34.16
3756   3.3125      44.0  5.033520   1.000000       473.0  2.642458     34.18
15408  2.0246      16.0  5.302632   1.199013      1036.0  1.703947     33.22
322    1.1765      36.0  5.327044   1.333333       567.0  3.566038     37.74
15202  6.5853      16.0  7.379464   1.017857       690.0  3.080357     32.91
12157  2.3750      11.0  4.942105   0.984211       557.0  2.931579     33.67
7464   3.1912      42.0  4.851459   1.037135      1614.0  4.281167     33.93

       Longitude  MedHouseVal
1402     -122.08        2.430
18871    -122.21        1.270
3139     -118.17        0.879
4041     -118.50        4.240
3756     -118.38        1.864
15408    -117.23        1.488
322      -122.19        0.871
15202    -117.08        2.484
12157    -117.07        1.458
7464     -118.19        1.464

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
20635,1.5603,25.0,5.045455,1.133333,845.0,2.560606,39.48,-121.09,0.781
20636,2.5568,18.0,6.114035,1.315789,356.0,3.122807,39.49,-121.21,0.771
20637,1.7000,17.0,5.205543,1.120092,1007.0,2.325635,39.43,-121.22,0.923
20638,1.8672,18.0,5.329513,1.171920,741.0,2.123209,39.43,-121.32,0.847
20639,2.3886,16.0,5.254717,1.162264,1387.0,2.616981,39.37,-121.24,0.894

In [134]:
ch.describe()

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
count,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,3.870671,28.639486,5.429000,1.096675,1425.476744,3.070655,35.631861,-119.569704,2.068558
std,1.899822,12.585558,2.474173,0.473911,1132.462122,10.386050,2.135952,2.003532,1.153956
min,0.499900,1.000000,0.846154,0.333333,3.000000,0.692308,32.540000,-124.350000,0.149990
25%,2.563400,18.000000,4.440716,1.006079,787.000000,2.429741,33.930000,-121.800000,1.196000
50%,3.534800,29.000000,5.229129,1.048780,1166.000000,2.818116,34.260000,-118.490000,1.797000
75%,4.743250,37.000000,6.052381,1.099526,1725.000000,3.282261,37.710000,-118.010000,2.647250
max,15.000100,52.000000,141.909091,34.066667,35682.000000,1243.333333,41.950000,-114.310000,5.000010

In [135]:
print(ch.HouseAge)
print(ch.HouseAge.sum())
ch["AveRooms"].mean()

0        41.0
1        21.0
2        52.0
3        52.0
4        52.0
         ...
20635    25.0
20636    18.0
20637    17.0
20638    18.0
20639    16.0
Name: HouseAge, Length: 20640, dtype: float64
591119.0

np.float64(5.428999742190376)

***Functions***

In [136]:
def my_func(x):
    if x % 2 == 0:
        return x * 2
    else: 
        return x * 3

In [137]:
df

     name   age       occupation
0  vishnu  21.0           Gen AI
1     sai  27.0  data code entry
2  mukesh  24.0  web development
3  nithin  32.0     jr developer

In [138]:
df.age.apply(my_func)

0    63.0
1    81.0
2    48.0
3    64.0
Name: age, dtype: float64

In [139]:
df.age.apply(lambda x:  x * 2 if x % 2 == 0 else x * 3 )

0    63.0
1    81.0
2    48.0
3    64.0
Name: age, dtype: float64

In [140]:
df = df.set_index("name")
df

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0  data code entry
mukesh  24.0  web development
nithin  32.0     jr developer

In [ ]:
df.at["nithin","age"] = float("nan")

In [142]:
df.describe()

        age
count   3.0
mean   24.0
std     3.0
min    21.0
25%    22.5
50%    24.0
75%    25.5
max    27.0

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, vishnu to nithin
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         3 non-null      float64
 1   occupation  4 non-null      object
dtypes: float64(1), object(1)
memory usage: 268.0+ bytes

In [144]:
df.dropna()

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0  data code entry
mukesh  24.0  web development

In [145]:
df.age.fillna(df.age.max())

name
vishnu    21.0
sai       27.0
mukesh    24.0
nithin    27.0
Name: age, dtype: float64

In [146]:
df

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0  data code entry
mukesh  24.0  web development
nithin   NaN     jr developer

In [147]:
df.at["sai","occupation"] = None
df

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0             None
mukesh  24.0  web development
nithin   NaN     jr developer

In [148]:
df.dropna(subset=["age"])

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0             None
mukesh  24.0  web development

In [149]:
df.notna()

          age  occupation
name
vishnu   True        True
sai      True       False
mukesh   True        True
nithin  False        True

In [150]:
df[df.age.notna()]

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0             None
mukesh  24.0  web development

In [151]:
df

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0             None
mukesh  24.0  web development
nithin   NaN     jr developer

In [152]:
for i,row in df.iterrows():
    print(i)

vishnu
sai
mukesh
nithin

In [153]:
for i,row in df.iterrows():
    print(row)

age             21.0
occupation    Gen AI
Name: vishnu, dtype: object
age           27.0
occupation    None
Name: sai, dtype: object
age                      24.0
occupation    web development
Name: mukesh, dtype: object
age                    NaN
occupation    jr developer
Name: nithin, dtype: object

In [154]:
for i,row in df.iterrows():
    print(row["age"])

21.0
27.0
24.0
nan

In [155]:
for i,col in df.items():
    print(i)

age
occupation

In [156]:
for i,col in df.items():
    print(col)

name
vishnu    21.0
sai       27.0
mukesh    24.0
nithin     NaN
Name: age, dtype: float64
name
vishnu             Gen AI
sai                  None
mukesh    web development
nithin       jr developer
Name: occupation, dtype: object

In [157]:
for i,col in df.items():
    print(col["vishnu"])

21.0
Gen AI

In [158]:
df

         age       occupation
name
vishnu  21.0           Gen AI
sai     27.0             None
mukesh  24.0  web development
nithin   NaN     jr developer